# StructuralAssetFailures Properties

---
The BuiltInFailuresStructuralAssetFailures type exposes the following members.
| Name| Description
---|---|---
| StructuralMaterialAssetInvalid|  Material assigned to the Analytical Element does not contain Structure parameters - verify material content.
Top
#### Reference
BuiltInFailuresStructuralAssetFailures Class
Autodesk.Revit.DB Namespace